<h1 align="center">USDA Agricultural Production Analysis</h1>

---

## üåæ Context
You are a **Data Scientist** working at the **USDA**. Your department has been tracking the production of various agricultural commodities across different states.  

<details>
<summary><strong>Available Datasets</strong> üìÇ</summary>

- `milk_production`  
- `cheese_production`  
- `coffee_production`  
- `honey_production`  
- `yogurt_production`  
- `state_lookup` (state-level reference table)  

</details>

The data spans **multiple years and states**, with varying levels of production for each commodity.  

Your manager has requested that you generate insights from this data to support **future planning** and **decision-making**. You‚Äôll primarily use **SQL queries** to answer questions that arise in meetings, reports, or strategic discussions.

---

## üéØ Objectives
1. **Assess** state-by-state production for each commodity.  
2. **Identify** trends or anomalies in the data.  
3. **Recommend** data-backed suggestions for areas that may need more attention.  

---

## üóÇÔ∏è Notebook Roadmap
1. **Data Exploration** ‚Äì Load, preview, and clean datasets.  
2. **SQL Queries & Analysis** ‚Äì Perform state-level and time-series analysis.  
3. **Visualization** ‚Äì Create charts to highlight trends and anomalies.  
4. **Insights & Recommendations** ‚Äì Summarize findings for decision-making.  

---

## üîß Tools & Technologies
- **Python** ‚Äì for data manipulation and analysis  
- **SQLite** ‚Äì for querying and managing relational data  
- **Pandas** ‚Äì for data cleaning, transformation, and integration with SQL  

---

## ‚úÖ Deliverables
- **Cleaned and structured datasets** ready for analysis  
- **SQL queries** addressing production trends and comparisons  
- **Visualizations** (charts, tables, maps) that highlight key insights  
- **Actionable recommendations** for USDA decision-making  

---

### Setting Up Environment 
Connecting to database

In [14]:
# Import the necessary libraries
import sqlite3
import pandas as pd

# Setting up the database. DO NOT edit the code given below
conn = sqlite3.connect('./database/production3.db')

#### Test Query

In [15]:
query = ''' 
SELECT * 
FROM cheese_production 
LIMIT 5
'''
result = pd.read_sql(query, conn)
display(result)

   Year Period Geo_Level  State_ANSI  Commodity_ID Domain      Value
0  2023    APR     STATE           6             6  TOTAL  208807000
1  2023    APR     STATE          16             6  TOTAL   86452000
2  2023    APR     STATE          17             6  TOTAL    5068000
3  2023    APR     STATE          19             6  TOTAL   31512000
4  2023    APR     STATE          27             6  TOTAL   69728000

Deeper look at the 1st database

In [25]:
query = ''' 
PRAGMA table_info(cheese_production);
'''
result = pd.read_sql(query, conn)
display(result)

   cid          name     type  notnull dflt_value  pk
0    0          Year  INTEGER        0       None   0
1    1        Period     TEXT        0       None   0
2    2     Geo_Level     TEXT        0       None   0
3    3    State_ANSI  INTEGER        0       None   0
4    4  Commodity_ID  INTEGER        0       None   0
5    5        Domain     TEXT        0       None   0
6    6         Value  INTEGER        0       None   0

### Analysis Begin

Find the total milk production for the year 2023.

In [12]:
query = ''' 
SELECT SUM(Value) 
FROM milk_production 
WHERE Year = 2023;
'''
result = pd.read_sql(query, conn)
display(result)

    SUM(Value)
0  91812000000

Show coffee production data for the year 2015

In [26]:
query = ''' 
SELECT SUM(Value)
FROM coffee_production cp 
WHERE "Year" = 2015
'''
result = pd.read_sql(query, conn)
display(result)

   SUM(Value)
0     6600000

Find the average honey production for the year 2022.

In [11]:
query = ''' 
SELECT AVG(Value) 
FROM honey_production 
WHERE Year = 2022
'''
result = pd.read_sql(query, conn)
display(result)

   AVG(Value)
0   3133275.0

What number is Iowa?

In [28]:
query = '''
SELECT  State_ANSI
FROM state_lookup sl 
WHERE "State" = "IOWA"
'''
result = pd.read_sql(query, conn)
display(result)

   State_ANSI
0          19

Find the highest yogurt production value for the year 2022.

In [29]:
query = '''
SELECT MAX(Value)
FROM yogurt_production yp 
WHERE "Year" = 2022
'''
result = pd.read_sql(query, conn)
display(result)

   MAX(Value)
0   793256000

Find states where both honey and milk were produced in 2022.

In [8]:
query = '''
SELECT DISTINCT h.State_ANSI FROM honey_production h
JOIN milk_production m ON h.State_ANSI = m.State_ANSI
WHERE h.Year = 2022 AND m.Year = 2022
'''
result = pd.read_sql(query, conn)
display(result)

    State_ANSI
0            1
1            4
2            5
3            6
4            8
5           12
6           13
7           16
8           17
9           18
10          19
11          20
12          21
13          22
14          23
15          26
16          27
17          28
18          29
19          30
20          31
21          34
22          36
23          37
24          38
25          39
26          41
27          42
28          45
29          46
30          47
31          48
32          49
33          50
34          51
35          53
36          54
37          55
38          56

Find the total yogurt production for states that also produced cheese in 2022.

In [30]:
query = '''
SELECT SUM(y.Value)
FROM yogurt_production y
WHERE y.Year = 2022 AND y.State_ANSI IN (
    SELECT DISTINCT c.State_ANSI FROM cheese_production c WHERE c.Year = 2022
);
'''
result = pd.read_sql(query, conn)
display(result)

   SUM(y.Value)
0    1171095000

In [ ]:
query = '''
SELECT SUM(y.Value)
FROM yogurt_production y
WHERE y.Year = 2022 AND y.State_ANSI IN (
    SELECT DISTINCT c.State_ANSI FROM cheese_production c WHERE c.Year = 2022
);
'''
result = pd.read_sql(query, conn)
display(result)

### Close the Connection

In [16]:
# Close the database connection 
conn.close()